app/controllers/home_controller.rb

  def index

    @politicians = Politician.order(:last_name)

    @states = Hash.new
    @politicians.each do |p|
---
SELECT "politicians".* FROM "politicians"  ORDER BY "politicians"."last_name" ASC
SELECT  "politicians".* FROM "politicians" LIMIT 5 OFFSET 0